vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1175_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MIMXRT1175_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MIMXRT1175_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, cores=cm4f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/arm/MIMXRT1175xxxxx_cm4_flexspi_nor.scf" version="1.0.0" projectpath="MIMXRT1175/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm4f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/arm/MIMXRT1175xxxxx_cm4_flexspi_nor_sdram.scf" version="1.0.0" projectpath="MIMXRT1175/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm4f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/arm/MIMXRT1175xxxxx_cm4_ram.scf" version="1.0.0" projectpath="MIMXRT1175/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm4f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/arm/MIMXRT1175xxxxx_cm4_sdram.scf" version="1.0.0" projectpath="MIMXRT1175/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm4f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/arm/MIMXRT1175xxxxx_cm4_sdram_txt.scf" version="1.0.0" projectpath="MIMXRT1175/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm4f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/gcc/MIMXRT1175xxxxx_cm4_flexspi_nor.ld" version="1.0.0" projectpath="MIMXRT1175/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm4f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/gcc/MIMXRT1175xxxxx_cm4_flexspi_nor_sdram.ld" version="1.0.0" projectpath="MIMXRT1175/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm4f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/gcc/MIMXRT1175xxxxx_cm4_ram.ld" version="1.0.0" projectpath="MIMXRT1175/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm4f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/gcc/MIMXRT1175xxxxx_cm4_sdram.ld" version="1.0.0" projectpath="MIMXRT1175/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm4f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/gcc/MIMXRT1175xxxxx_cm4_sdram_txt.ld" version="1.0.0" projectpath="MIMXRT1175/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm4f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/iar/MIMXRT1175xxxxx_cm4_flexspi_nor.icf" version="1.0.0" projectpath="MIMXRT1175/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm4f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/iar/MIMXRT1175xxxxx_cm4_flexspi_nor_sdram.icf" version="1.0.0" projectpath="MIMXRT1175/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm4f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/iar/MIMXRT1175xxxxx_cm4_ram.icf" version="1.0.0" projectpath="MIMXRT1175/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm4f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/iar/MIMXRT1175xxxxx_cm4_sdram.icf" version="1.0.0" projectpath="MIMXRT1175/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm4f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/iar/MIMXRT1175xxxxx_cm4_sdram_txt.icf" version="1.0.0" projectpath="MIMXRT1175/iar"/>
        <file condition="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/arm/MIMXRT1175xxxxx_cm7_flexspi_nor.scf" version="1.0.0" projectpath="MIMXRT1175/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/arm/MIMXRT1175xxxxx_cm7_flexspi_nor_sdram.scf" version="1.0.0" projectpath="MIMXRT1175/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/arm/MIMXRT1175xxxxx_cm7_ram.scf" version="1.0.0" projectpath="MIMXRT1175/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/arm/MIMXRT1175xxxxx_cm7_sdram.scf" version="1.0.0" projectpath="MIMXRT1175/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/arm/MIMXRT1175xxxxx_cm7_sdram_txt.scf" version="1.0.0" projectpath="MIMXRT1175/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/gcc/MIMXRT1175xxxxx_cm7_flexspi_nor.ld" version="1.0.0" projectpath="MIMXRT1175/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/gcc/MIMXRT1175xxxxx_cm7_flexspi_nor_sdram.ld" version="1.0.0" projectpath="MIMXRT1175/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/gcc/MIMXRT1175xxxxx_cm7_ram.ld" version="1.0.0" projectpath="MIMXRT1175/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/gcc/MIMXRT1175xxxxx_cm7_sdram.ld" version="1.0.0" projectpath="MIMXRT1175/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/gcc/MIMXRT1175xxxxx_cm7_sdram_txt.ld" version="1.0.0" projectpath="MIMXRT1175/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/iar/MIMXRT1175xxxxx_cm7_flexspi_nor.icf" version="1.0.0" projectpath="MIMXRT1175/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/iar/MIMXRT1175xxxxx_cm7_flexspi_nor_sdram.icf" version="1.0.0" projectpath="MIMXRT1175/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/iar/MIMXRT1175xxxxx_cm7_ram.icf" version="1.0.0" projectpath="MIMXRT1175/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/iar/MIMXRT1175xxxxx_cm7_sdram.icf" version="1.0.0" projectpath="MIMXRT1175/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1175xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1175/iar/MIMXRT1175xxxxx_cm7_sdram_txt.icf" version="1.0.0" projectpath="MIMXRT1175/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MIMXRT1175" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MIMXRT1175</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT1175/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1175/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1175/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1175/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1175/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1175/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1175/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1175/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT1175/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MIMXRT1175_startup</description>
      <files>
        <file condition="allOf.toolchains=iar, core_ids=cm4.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1175/iar/startup_MIMXRT1175_cm4.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc, core_ids=cm4.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1175/gcc/startup_MIMXRT1175_cm4.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk, core_ids=cm4.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1175/arm/startup_MIMXRT1175_cm4.S" version="1.0.0" projectpath="startup/arm"/>
        <file condition="allOf.toolchains=iar, core_ids=cm7.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1175/iar/startup_MIMXRT1175_cm7.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc, core_ids=cm7.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1175/gcc/startup_MIMXRT1175_cm7.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk, core_ids=cm7.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1175/arm/startup_MIMXRT1175_cm7.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1175_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MIMXRT1175_system</description>
      <files>
        <file condition="allOf.core_ids=cm4.condition_id" category="sourceC" name="devices/MIMXRT1175/system_MIMXRT1175_cm4.c" projectpath="device"/>
        <file condition="allOf.core_ids=cm4.condition_id" category="header" name="devices/MIMXRT1175/system_MIMXRT1175_cm4.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm7.condition_id" category="sourceC" name="devices/MIMXRT1175/system_MIMXRT1175_cm7.c" projectpath="device"/>
        <file condition="allOf.core_ids=cm7.condition_id" category="header" name="devices/MIMXRT1175/system_MIMXRT1175_cm7.h" projectpath="device"/>
        <file category="include" name="devices/MIMXRT1175/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="acmp" Cversion="2.3.0" condition="driver.acmp.condition_id">
      <description>ACMP Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1175/drivers/fsl_acmp.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1175/drivers/fsl_acmp.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1175/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc_etc" Cversion="2.3.2" condition="driver.adc_etc.condition_id">
      <description>ADC_ETC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1175/drivers/fsl_adc_etc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1175/drivers/fsl_adc_etc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1175/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
