vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1175_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sema4" Cversion="2.2.2" condition="driver.sema4.condition_id">
      <description>SEMA4 Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1175/drivers/fsl_sema4.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1175/drivers/fsl_sema4.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1175/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="semc" Cversion="2.7.1" condition="driver.semc.condition_id">
      <description>SEMC Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1175/drivers/fsl_semc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1175/drivers/fsl_semc.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1175/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl5000" Cversion="2.1.1" condition="driver.sgtl5000.condition_id">
      <description>Driver sgtl5000</description>
      <RTE_Components_h>
#ifndef CODEC_SGTL5000_ENABLE
#define CODEC_SGTL5000_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/sgtl5000/fsl_sgtl5000.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/sgtl5000/fsl_sgtl5000.c" projectpath="codec"/>
        <file category="include" name="components/codec/sgtl5000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="smartcard_emvsim" Cversion="2.3.0" condition="driver.smartcard_emvsim.condition_id">
      <description>SMARTCARD EMVSIM Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1175/drivers/fsl_smartcard.h" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1175/drivers/fsl_smartcard_emvsim.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1175/drivers/fsl_smartcard_emvsim.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1175/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="smartcard_phy_emvsim" Cversion="2.3.0" condition="driver.smartcard_phy_emvsim.condition_id">
      <description>SMARTCARD PHY EMVSIM, use only one SMARTCARD PHY in the project</description>
      <RTE_Components_h>
#ifndef USING_PHY_EMVSIM
#define USING_PHY_EMVSIM 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="devices/MIMXRT1175/drivers/fsl_smartcard_phy.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1175/drivers/fsl_smartcard_phy_emvsim.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1175/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="smartcard_uart" Cversion="2.3.0" condition="driver.smartcard_uart.condition_id">
      <description>SMARTCARD UART Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1175/drivers/fsl_smartcard.h" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1175/drivers/fsl_smartcard_uart.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1175/drivers/fsl_smartcard_uart.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1175/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="snvs_hp" Cversion="2.3.2" condition="driver.snvs_hp.condition_id">
      <description>SNVS HP Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1175/drivers/fsl_snvs_hp.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1175/drivers/fsl_snvs_hp.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1175/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="snvs_lp" Cversion="2.4.6" condition="driver.snvs_lp.condition_id">
      <description>SNVS LP Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1175/drivers/fsl_snvs_lp.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1175/drivers/fsl_snvs_lp.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1175/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spdif" Cversion="2.0.7" condition="driver.spdif.condition_id">
      <description>SPDIF Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1175/drivers/fsl_spdif.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1175/drivers/fsl_spdif.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1175/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spdif_edma" Cversion="2.0.8" condition="driver.spdif_edma.condition_id">
      <description>SPDIF EDMA Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1175/drivers/fsl_spdif_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1175/drivers/fsl_spdif_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1175/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="soc_src" Cversion="2.1.1" condition="driver.src_2.condition_id">
      <description>SOC SRC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1175/drivers/fsl_soc_src.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1175/drivers/fsl_soc_src.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1175/drivers/"/>
      </files>
    </component>
